# Brewfile.pentest — opt-in pentest / CTF tier
#
# Run with: `brew bundle --file=bootstrap/Brewfile.pentest`
# Only run AFTER the main Brewfile completes successfully.
#
# These tools are installed on the current machine but classified as
# KEEP_LATER / unclassified — not required for day-1 dev workflow.
# Many pull in big native deps and slow down `brew bundle` significantly.
#
# Reasoning per category below.

# ===================================================================
# Recon / enumeration
# ===================================================================
brew "amass"
brew "subfinder"
brew "ffuf"
brew "gobuster"
brew "feroxbuster"

# ===================================================================
# Web app scanners
# ===================================================================
brew "nuclei"
brew "nikto"
brew "sqlmap"

# ===================================================================
# Network scanners
# ===================================================================
brew "masscan"
brew "rustscan"
# brew "nmap"            # already installed by main Brewfile

# ===================================================================
# Password / hash cracking
# ===================================================================
brew "hashcat"
brew "hydra"
brew "john-jumbo"

# ===================================================================
# Exploit dev / reference
# ===================================================================
brew "exploitdb"

# ===================================================================
# Cask: Metasploit
# Heavy install; only enable if actively used.
# ===================================================================
cask "metasploit"

# ===================================================================
# Java toolchain (Metasploit / large-app deps)
# Uncomment only if needed; pulls in JDK + Maven + Gradle.
# ===================================================================
# brew "openjdk"
# brew "maven"
# brew "gradle"
